Repository: tallstreet/Tall-Street-Site-Search
Catalog: search/locale/*/LC_MESSAGES/django.po
Languages: de, it

source: All
de: Alle
it: tutti

source: Print daily news
de: Tageszeitungen
it: Quotidiani

source: Print magazines
de: Magazine
it: Settimanale

source: Print trade press
de: Fachpresse
it: Riviste

source: TV
it: Televisione

source: Freelance
it: indipendente

source: Other
de: andere
it: diverso

source: Name
it: Cognome

source: First Name
de: Vorname
it: Nome

source: Category*
de: Kategorie
it: Categoria

source: Language*
de: Sprache
it: Lingua

source: Location
de: Ort
it: Località

source: Publications
de: Medium
it: Pubblicazioni

source: All Listings
de: Alle Einträge
it: Tutte le inserzioni

source: Recently Changed
de: letzte Änderungen
it: Recentemente cambiato

source: Swiss Journalists
de: Journalisten auf Twitter
it: I giornalisti svizzeri usando Twitter

source: This is a directory of Swiss Journalists on <a href="http://www.twitter.com/">Twitter
de: Dies ist ein Verzeichnis schweizerischer JournalistInnen, die auf <a href="http://www.twitter.com/">Twitter aktiv sind.
it: Questa è una directory di giornalisti svizzeri su <a href="http://www.twitter.com/">Twitter

source: Add Yourself
de: Tragen Sie sich ein
it: Aggiungi te

source: Listing is free
de: Der Eintrag ist gratis
it: Inserzione è libero

source: add a journalist
de: JournalistIn hinzufügen
it: aggiungere un giornalista

source: Top Users
de: Top Einträge
it: migliori

source: Endorsed
de: Akkreditiert
it: Parere

source: Details
it: Dettagli

source: Sort
de: Sortieren
it: classificare

source: Popularity
de: Popularität
it: Popolarità

source: Recently Added
de: neuste Einträge
it: recentemente aggiunto

source: Options
de: Optionen
it: Opzioni

source: Add Journalist
de: Journalist hinzufügen
it: Aggiungi Giornalista

source: Edit
de: Bearbeiten
it: Modifica

source: Delete
de: Löschen
it: Eliminare

source: Endorse
de: Akkreditieren
it: Approvare
